simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
/* -------------------------------------------------------------------------- */

static void rx_watchdog_start(void) { g_rx_watch_ticks = 0u; watchdog_rx = 0u; }
static void rx_watchdog_stop(void)  { g_rx_watch_ticks = 0u; watchdog_rx = 0u; }

static void led_write(uint8 value)
{
#ifdef CY_PINS_LED_H
    LED_Write(value);
#else
    (void)value;
#endif
}

static void led_toggle(void)
{
#ifdef CY_PINS_LED_H
    if (g_state != PSOC_SAMPLING) {
        LED_Write(LED_Read() ^ 0x01u);
    }
#endif
}

static uint32 timer_now_ticks(void)
{
    uint32 ticks;
    uint8 saved = CyEnterCriticalSection();
    ticks = g_timer_ticks;
    CyExitCriticalSection(saved);
    return ticks;
}

uint32 psoc_now_ticks(void)
{
    return timer_now_ticks();
}

static uint8 ticks_due(uint32 now, uint32 due)
{
    return ((int32)(now - due) >= 0) ? 1u : 0u;
}

/* Selecciona, vía Reg_Select (control_0), si el canal raw del ADC va directo
 * a RAM (use_filter=0, captura cruda) o hacia el Canal A del Filter de
 * hardware (use_filter=1). La exclusión la imponen las compuertas del
 * TopDesign (DMA_DelSig_RAM vs DMA_DelSig_Filter); acá solo se escribe el bit. */
void dma_route_select(uint8 use_filter)
{
    Reg_Select_Write(use_filter ? 0x01u : 0x00u);
}

static uint8 psoc_seed_calibration_from_nv(uint8 reset_defaults_if_missing)
{
    uint8 nv_dac[PSOC_NV_CAL_STAGES];
    uint8 stage_count = psoc_calibration_stage_count();

    if (!g_nv_ready || stage_count == 0u || stage_count > PSOC_NV_CAL_STAGES) {
        return 0u;
    }

    if (psoc_nv_load_for_gain(g_pga_code, nv_dac, stage_count)) {
        psoc_calibration_seed_dac(nv_dac, stage_count);
        return 1u;
    }

    if (reset_defaults_if_missing) {
        psoc_calibration_seed_default_dac();
    }
    return 0u;
}

static void PGAgain_Set(uint8 code)
{
    if (code <= 8u) {
        uint8 changed = (g_pga_code != code) ? 1u : 0u;
        g_pga_code = code;
        psoc_hw_set_pga(code);
        if (changed) {
            g_last_calibration_ok = 0u;
            (void)psoc_seed_calibration_from_nv(1u);
        }
    }
}

static void PGAvdac_Set(uint8 code)
{
    if (code <= 8u) {
        g_pgavdac_code = code;
        psoc_hw_set_pgavdac(code);
    }
}

static void psoc_arm(void)
{
    uint8 saved;
    psoc_prepare_capture_path();
    saved = CyEnterCriticalSection();
    capture_reset_locked();
    g_state = PSOC_ARMED;
    CyExitCriticalSection(saved);
    uart_send_diag(PSOC_EVT_ARMED, diag_u16_sat(g_n_batches));
}

static void psoc_start_now(void)
{
    psoc_prepare_capture_path();
    psoc_enter_sampling(0u);
}

static uint8 psoc_start_calibration_if_idle(uint8 send_ack)
{
    uint8 cal_start;

    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_batches_sent = 0u;
    g_batches_captured = 0u;
    g_capture_done = 0u;
    g_last_calibration_ok = 0u;
    psoc_calibration_servo_abort();
    /* La ruta del DMA (raw vs Filter) y el AMux los gobierna cal_pi_stage_begin
     * (calibration.c) por etapa -- no hace falta forzar nada aca. */
    uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    uart_send_diag(PSOC_EVT_CAL_START, 0u);
    cal_start = psoc_calibration_start_async();
    if (cal_start == 2u) {
        g_last_calibration_ok = 1u;
        timer_start_runtime();
        dma_route_select(g_stream_mode);
        uart_send_diag(PSOC_EVT_CAL_DONE, 1u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 1u);
        }
        return 1u;
    }
    if (!cal_start) {
        uart_send_diag(PSOC_EVT_CAL_DONE, 0u);
        if (send_ack) {
            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
        }
        return 0u;
    }
    g_cal_ack_pending = send_ack ? 1u : 0u;
    g_state = PSOC_CALIBRATING;
    return 1u;
}

static void psoc_report_adc_snapshot_if_idle(void)
{
    if (g_state != PSOC_IDLE) {
        uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
        uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 0u);
        return;
    }

    psoc_calibration_servo_abort();
    uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 1u);
    psoc_calibration_report_adc_snapshot();
    dma_route_select(g_stream_mode);
}

static uint8 service_button_calibration(void)
{
#if !PSOC_BUTTON_CAL_ENABLE
    return 0u;
#else
    if (!g_cal_button_pressed) {
        return 0u;
    }

    g_cal_button_pressed = 0u;
    uart_send_diag(PSOC_EVT_BUTTON, g_state);
    if (g_state == PSOC_IDLE) {
        (void)psoc_start_calibration_if_idle(0u);
    } else {
        uart_send_diag(PSOC_EVT_BUTTON_IGNORED, g_state);
    }
    return 1u;
#endif
}

static void uart_send_capture_batch(uint16 batchIndex)
{
    uint8  frame[FRAME_BYTES];
    uint8 *p;
    uint16 i;
    uint16 pos;
    uint8  crc = 0u;

    frame[0] = 0xABu;
    frame[1] = (uint8)BATCH_SAMPLES;
    frame[2] = (uint8)( g_seq        & 0xFFu);
    frame[3] = (uint8)((g_seq >> 8u) & 0xFFu);

    p = &frame[4];
    for (i = 0u; i < BATCH_SAMPLES; i++, p += 3u)
    {
        pos  = (uint16)(i * SAMPLE_BYTES);
        p[0] = g_capture_raw[batchIndex][pos];
        p[1] = g_capture_raw[batchIndex][pos + 1u];
        p[2] = g_capture_raw[batchIndex][pos + 2u];
    }

    for (i = 0u; i < (FRAME_BYTES - 1u); i++) { crc ^= frame[i]; }
    frame[FRAME_BYTES - 1u] = crc;

    g_seq++;
    UART_PutArray(frame, FRAME_BYTES);
}

static void uart_service(void)
{
    uint8 rx;
    while (UART_GetRxBufferSize() > 0u)
    {
        rx = UART_ReadRxData();
        switch (rx_state)
        {
            case 0u:
                if (rx == 0xABu) { rx_state = 1u; rx_watchdog_start(); }
                break;

            case 1u:
                rx_watchdog_start();
                switch (rx)
                {
                    case 0xA5u: case 0xA6u: case 0xA9u: case 0xAAu:
                    case 0xB1u: case 0xB3u: case 0xB4u: case PSOC_CMD_CALIBRATE:
                    case PSOC_CMD_SAVE_EEPROM: case PSOC_CMD_SELECT_STREAM:
                    case PSOC_CMD_ADC_SNAPSHOT:
                    case PSOC_CMD_BLINK_LED:
                    case PSOC_CMD_PONG:
                        rx_cmd = rx; rx_state = 2u; break;
                    case 0xA3u:
                        rx_cmd = rx; rx_state = 4u; break;
                    default:
                        rx_watchdog_stop(); rx_state = 0u; break;
                }
                break;

            case 2u:
                rx_p1 = rx; rx_p2 = 0u; rx_state = 3u; rx_watchdog_start();
                break;

            case 4u:
                rx_p1 = rx; rx_state = 5u; rx_watchdog_start();
                break;

            case 5u:
                rx_p2 = rx; rx_state = 3u; rx_watchdog_start();
                break;

