simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
            case 3u:
                rx_watchdog_stop(); rx_state = 0u;
                if (rx != (uint8)(rx_cmd ^ rx_p1 ^ rx_p2)) { break; }

                if (!g_esp_connected) {
                    /* Durante reset/upload del ESP, el TX hacia el PSoC puede
                     * emitir bytes que por casualidad formen un frame valido.
                     * No aceptar comandos de configuracion/captura como
                     * handshake: solo PONG/STATUS abren la comunicacion real. */
                    if (rx_cmd != PSOC_CMD_PONG && rx_cmd != 0xA5u) {
                        break;
                    }
                    g_esp_connected = 1u;
                    uart_send_diag(PSOC_EVT_ESP_SEEN, rx_cmd);
                }
                if (rx_cmd != PSOC_CMD_PONG) {
                    uart_send_diag(PSOC_EVT_RX_CMD, rx_cmd);
                }

                if (g_state == PSOC_CALIBRATING) {
                    switch (rx_cmd)
                    {
                        case PSOC_CMD_PONG:
                            break;
                        case 0xA5u:
                            uart_send_diag(PSOC_EVT_STATUS_REQ, 0u);
                            uart_send_ping();
                            uart_send_fs_report();
                            break;
                        case PSOC_CMD_CALIBRATE:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
                            uart_send_cfg_ack(PSOC_CMD_CALIBRATE, 0u);
                            break;
                        case PSOC_CMD_ADC_SNAPSHOT:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, g_state);
                            uart_send_cfg_ack(PSOC_CMD_ADC_SNAPSHOT, 0u);
                            break;
                        case 0xA6u: case 0xA9u: case 0xAAu:
                        case 0xB1u: case 0xB3u: case 0xB4u:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, rx_cmd);
                            uart_send_cfg_ack(rx_cmd, 0u);
                            break;
                        default:
                            uart_send_diag(PSOC_EVT_CAL_BUSY, rx_cmd);
                            break;
                    }
                    break;
                }

                switch (rx_cmd)
                {
                    case PSOC_CMD_PONG: break;
                    case 0xA5u:
                        uart_send_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
                        uart_send_diag(PSOC_EVT_STATUS_REQ, 0u);
                        uart_send_ping();
                        uart_send_fs_report();
                        break;
                    case 0xA6u:
                        PGAgain_Set(rx_p1);
                        uart_send_cfg_ack(0xA6u, g_pga_code);
                        led_toggle(); break;
                    case 0xA9u:
                        PGAvdac_Set(rx_p1);
                        uart_send_cfg_ack(0xA9u, g_pgavdac_code);
                        led_toggle(); break;
                    case 0xAAu:
                        /* Legacy command: hardware now uses the four VDAC_ref_* refs. */
                        g_vdac_val = rx_p1;
                        uart_send_cfg_ack(0xAAu, g_vdac_val);
                        led_toggle(); break;
                    case 0xA3u:
                        g_n_batches = (uint16)rx_p1 | ((uint16)rx_p2 << 8u);
                        uart_send_diag(PSOC_EVT_SETN, diag_u16_sat(g_n_batches));
                        break;
                    case 0xB1u:
                        psoc_arm();
                        uart_send_cfg_ack(0xB1u, g_state);
                        led_toggle();
                        break;
                    case 0xB4u:
                        uart_send_diag(PSOC_EVT_START_NOW, 0u);
                        uart_send_cfg_ack(0xB4u, 1u);
                        psoc_start_now();
                        led_toggle();
                        break;
                    case 0xB3u:
#if PSOC_RAMP_DEBUG_ENABLE
                        g_debug_psoc = (rx_p1 == 0u) ? 0u : 1u;
                        uart_send_diag(PSOC_EVT_DEBUG_MODE, g_debug_psoc);
                        if (g_debug_psoc) {
                            psoc_prepare_capture_path();
                            psoc_enter_sampling(1u);
                        } else {
                            ADC_StopConvert();
                            psoc_prepare_capture_path();
                            timer_start_runtime();
                            g_batch_fill   = 0u;
                            g_batch_ready  = 0u;
                            g_capture_done = 0u;
                            g_state        = PSOC_IDLE;
                        }
#else
                        (void)rx_p1;
                        uart_send_diag(PSOC_EVT_DEBUG_MODE, 0u);
#endif
                        break;
                    case PSOC_CMD_CALIBRATE:
                        (void)psoc_start_calibration_if_idle(1u);
                        led_toggle();
                        break;
                    case PSOC_CMD_SAVE_EEPROM:
                        /* Guardar los DAC de calibración actuales en EEPROM.
                         * El gate es vs PSOC_CAL_STAGE_COUNT (2 en HAMMER, no
                         * el tope fijo PSOC_NV_CAL_STAGES=4 del layout EEPROM
                         * — con ese tope fijo HAMMER nunca guardaba nada).
                         * No se pisa el slot si alguna etapa quedó ok=0. */
                        {
                            uint8 dac_snap[PSOC_NV_CAL_STAGES];
                            uint8 ok_snap = 0u;
                            uint8 stage_count = psoc_calibration_stage_count();
                            uint8 k;
                            for (k = 0u; k < PSOC_NV_CAL_STAGES; k++) {
                                dac_snap[k] = 0u;
                            }
                            for (k = 0u; k < PSOC_NV_CAL_STAGES && k < stage_count; k++) {
                                dac_snap[k] = g_psoc_cal_results[k].final_dac;
                            }
                            if (g_last_calibration_ok &&
                                g_psoc_cal_result_count >= stage_count) {
                                ok_snap = 1u;
                                for (k = 0u; k < stage_count; k++) {
                                    if (!g_psoc_cal_results[k].ok) {
                                        ok_snap = 0u;
                                        break;
                                    }
                                }
                                if (ok_snap) {
                                    ok_snap = psoc_nv_save_for_gain(g_pga_code, dac_snap, stage_count);
                                }
                            }
                            uart_send_cfg_ack(PSOC_CMD_SAVE_EEPROM, ok_snap);
                        }
                        led_toggle();
                        break;
                    case PSOC_CMD_SELECT_STREAM:
                        /* rx_p1: 0=crudo, 1=filtrado FIR */
                        g_stream_mode = (rx_p1 != 0u) ? 1u : 0u;
                        if (g_stream_mode != 0u) {
                            (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23,
                                                                     FILTER_FIR_NTAPS);
                            psoc_filter_reset_history();
                            psoc_adc_clear_isr_filtered_sample();
                            isr_DMA_Filter_RAM_ClearPending();
                        }
                        dma_route_select(g_stream_mode);
                        if (g_stream_mode != 0u) {
                            g_fir_discard = 0u;  /* reset — se recarga en próximo SyncIn */
                        }
                        uart_send_cfg_ack(PSOC_CMD_SELECT_STREAM, g_stream_mode);
                        led_toggle();
                        break;
                    case PSOC_CMD_ADC_SNAPSHOT:
                        psoc_report_adc_snapshot_if_idle();
                        led_toggle();
                        break;
                    case PSOC_CMD_BLINK_LED:
                        /* Titilar LED para identificar el nodo. No bloqueante:
                         * service_comm_led hace el toggle sobre el tick del Timer
                         * mientras g_comm_countdown > 0, y luego el LED vuelve a
                         * su reposo (encendido fijo). El diag PSOC_EVT_RX_CMD ya
                         * emitido más arriba confirma la recepción por el sniffer. */
                        g_comm_countdown = IDENTIFY_BLINK_TICKS;
                        break;
                    default: break;
                }
                break;

            default:
                rx_state = 0u; break;
        }
    }
}

static void service_runtime(void)
{
    if (g_state == PSOC_CALIBRATING) {
        if (psoc_calibration_service_async()) {
            uint8 ok = psoc_calibration_async_result_ok();
            g_state = PSOC_IDLE;
            g_last_calibration_ok = ok ? 1u : 0u;
            timer_start_runtime();
            dma_route_select(g_stream_mode);  /* restaura ruta previa a la calibración */
            uart_send_diag(PSOC_EVT_CAL_DONE, ok);
            if (g_cal_ack_pending) {
                g_cal_ack_pending = 0u;
                uart_send_cfg_ack(PSOC_CMD_CALIBRATE, ok);
            }
        }
        uart_service();
        return;
    }

    if (g_state == PSOC_SAMPLING) {
        if (g_capture_done == 0u) {
            return;   /* Silencio total: sin UART RX/TX, sin LED, sin pings. */
        }
        ADC_StopConvert();
        timer_start_runtime();
        uart_send_diag(PSOC_EVT_CAPTURE_DONE, diag_u16_sat(g_batches_captured));
        g_capture_done = 0u;
        g_state = PSOC_IDLE;
    }

    if (capture_dump_pending()) {
        if (g_batches_sent == 0u) {
            uart_send_diag(PSOC_EVT_DUMP_START, diag_u16_sat(g_batches_captured));
        }
        uart_send_capture_batch(g_batches_sent);
        g_batches_sent++;
        if (!capture_dump_pending()) {
            uart_send_diag(PSOC_EVT_DUMP_DONE, diag_u16_sat(g_batches_sent));
        }
        return;
    }

    if (watchdog_rx) { watchdog_rx = 0u; rx_state = 0u; }

