simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/main.c
    EEPROM_Start();
    g_nv_ready = 1u;

    psoc_hw_start_analog(g_pga_code, g_pgavdac_code);
    /* Arranca todos los VDAC de calibracion en su adelanto/feedforward de
     * tabla. Si EEPROM tiene una calibracion valida, se pisa justo abajo con
     * esos valores guardados para ahorrar aun mas tiempo. */
    psoc_calibration_start_references();

    /* Siempre arranca con el ultimo slot EEPROM de la ganancia actual.
     * Si no hay slot valido, deja explicitamente los adelantos nominales. */
#if PSOC_LOAD_NV_CAL_ON_BOOT
    (void)psoc_seed_calibration_from_nv(1u);
#endif

    Filter_Start();
    /* Activa el FIR de adquisicion (FIR_adquisition.h) -- calibration.c
     * carga el de calibracion (FIR_calibration.h) solo durante una corrida
     * y restaura este al terminar (ver cal_pi_start/cal_async_complete). */
    (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23, FILTER_FIR_NTAPS);
    dma_adc_init();

    psoc_prepare_capture_path();
    uart_send_diag(PSOC_EVT_ANALOG_READY, 0u);

    isr_DMA_DelSig_RAM_StartEx(isr_DMA_DelSig_RAM_Handler);
    isr_DMA_Filter_RAM_StartEx(isr_DMA_Filter_RAM_Handler);
    isr_Timer_StartEx(isr_Timer);
    isr_SyncIn_StartEx(isr_SyncIn);
    Clock_1_Start();
#if PSOC_BUTTON_CAL_ENABLE
    isr_Button_ClearPending();
    isr_Button_StartEx(isr_Button_Handler);
#endif

    Timer_Stop();
    Timer_WritePeriod(TIMEOUT_COUNTS);
    Timer_Start();

    /* ── Loop de arranque: busca el ESP sin bloquear UART/ADC ───────────── */
    wait_for_esp();
    psoc_calibration_servo_enable(0u);

    /* ── 5 parpadeos rápidos al conectar ─────────────────────────────────── */
    for (i = 0u; i < 5u; i++)
    {
        led_write(0u); wait_ticks(CONNECT_BLINK_TICKS);
        led_write(1u); wait_ticks(CONNECT_BLINK_TICKS);
    }

    /* ── Loop principal ─────────────────────────────────────────────────── */
    for (;;)
    {
        static uint32 idlePingDue = 0u;
        uint32 now;

        if (service_button_calibration()) {
            continue;
        }
        service_runtime();

        if (g_state == PSOC_SAMPLING || capture_dump_pending()) {
            continue;   /* Sin LED ni pings durante captura y volcado */
        }
        now = timer_now_ticks();

        if (g_state == PSOC_IDLE && !capture_dump_pending()) {
            (void)psoc_calibration_servo_service();
        }

        if (g_state == PSOC_IDLE && !capture_dump_pending())
        {
            if (idlePingDue == 0u) {
                idlePingDue = now + IDLE_PING_TICKS;
            }
            if (ticks_due(now, idlePingDue))
            {
                idlePingDue = now + IDLE_PING_TICKS;
                uart_send_ping();
            }
        }
        else
        {
            idlePingDue = 0u;
        }

        service_comm_led(now);
    }
}

/* [] END OF FILE */
